In [1]:
import numpy as np
import pandas as pd

# Read
df = pd.read_csv('Data/MPS Stolen Animals Raw.csv')

# Standardise headers
df.columns = (df.columns
              .str.strip()
              .str.lower()
              .str.replace(' ', '_')
              .str.replace('-', '_')
              .str.replace('.', '_'))

display(df.head(3))

,count_of_stolen_animals,type_of_animal,borough,type_of_offence,animal_recovered,year_and_month
0,1.0,Dog,Lambeth,Theft and Handling,Not Recovered,Jan-2010
1,1.0,Dog,Islington,Violence Against the Person,Not Recovered,Jan-2010
2,1.0,Dog,Croydon,Robbery,Not Recovered,Jan-2010

#### MISSING DATA

In [2]:
# Missing data
display(df.isna().sum())
print('\n---\n')
display(round(df.isna().mean() * 100, 2))

count_of_stolen_animals    3
type_of_animal             1
borough                    0
type_of_offence            0
animal_recovered           0
year_and_month             0
dtype: int64

---

count_of_stolen_animals    0.05
type_of_animal             0.02
borough                    0.00
type_of_offence            0.00
animal_recovered           0.00
year_and_month             0.00
dtype: float64

#### VALUES

In [3]:
# Standardise string values
str_cols = df.select_dtypes(include=['string']).columns
df[str_cols] = df[str_cols].apply(lambda x: x.str.strip().str.lower())

# View
display(df.head(3))

,count_of_stolen_animals,type_of_animal,borough,type_of_offence,animal_recovered,year_and_month
0,1.0,dog,lambeth,theft and handling,not recovered,jan-2010
1,1.0,dog,islington,violence against the person,not recovered,jan-2010
2,1.0,dog,croydon,robbery,not recovered,jan-2010

#### FILTER DATA

In [4]:
# Filter animal type
df = df[df['type_of_animal'] == 'dog'].copy()

# Reset index
df.reset_index(drop=True, inplace=True)

# View
df['type_of_animal'].value_counts()

type_of_animal
dog    3747
Name: count, dtype: int64

#### DROP COLUMNS

In [5]:
# Drop columns
df.drop(['count_of_stolen_animals', 'type_of_animal', 'type_of_offence'], axis=1, inplace=True)

# View
display(df.head(3))

     borough animal_recovered year_and_month
0    lambeth    not recovered       jan-2010
1  islington    not recovered       jan-2010
2    croydon    not recovered       jan-2010

#### WRITE CLEAN DATAFRAME

In [6]:
# Write
df.to_csv('Data/MPS Stolen Animals Clean.csv', index=False)

# View
display(df.head(3))

     borough animal_recovered year_and_month
0    lambeth    not recovered       jan-2010
1  islington    not recovered       jan-2010
2    croydon    not recovered       jan-2010